library(markdown)
library(shiny)
library(DT)
library(ECharts2Shiny)
library(PW.GY)


shinyUI(navbarPage(
    # We HAVE TO to load the ECharts javascript library in advance
    loadEChartsLibrary(),

    's',
    tabPanel(
        'Main'
    )

#     "售电模拟",
#
#     tabPanel(
#         "主页",
#         fluidRow(
#             column(8,
#                    offset=2,
#                    h1("应用简介"),
#                    br(),
#                    p("本售电模拟应用由华中科技大学的",strong("YoungGy"),"制作，其核心代码参照了",strong("YoungGy"),"的博文",
#                      tags$a("电力竞价(广东规则)详解与代码",href="http://blog.younggy.com/2016/08/26/%E7%94%B5%E5%8A%9B%E7%AB%9E%E4%BB%B7-%E5%B9%BF%E4%B8%9C%E8%A7%84%E5%88%99-%E8%AF%A6%E8%A7%A3%E4%B8%8E%E4%BB%A3%E7%A0%81/"),"。"),
#                    p("该代码及其应用的目的是:促进大家对电力竞价规则的了解，共同学习电力交易的相关规则，共同进步。"),
#                    p("本售电模拟应用及其相关代码仅供学习使用。如需转载请联系",strong("YoungGy"),"。"),
#                    tags$ul(tags$li("邮箱地址：771657815@qq.com"),tags$li("微信号：guangzhixingno1")),
#                    p("该代码的算例引用了售电市场研修院的部分内容，并感谢北京清软创新科技股份有限公司研究中心主任罗欣女士的讲解。"),
#
#                    h1("竞价规则"),
#                    br(),
#                    p("本竞价规则参考广东电力交易中心目前的竞价规则，详情可登陆",tags$a("广东省经济和信息化委员会网站",href="http://www.gdei.gov.cn/"),"查看。"),
#
#                    h2("交易规模"),
#                    p("交易牵涉两大角色，卖电方和买电方："),
#                    tags$ul(tags$li("卖电方：发电企业"),tags$li("买电方：售电公司、电力大用户")),
#                    p("交易牵涉一个变量"),
#                    tags$ul(tags$li("成交比例")),
#                    p("也就是说，买卖双方的电量不会全部成交。","例如，如果发电企业意向申报交易规模100万千瓦时，售电公司意向申报规模80万千瓦时，电力大用户意向申报20万千瓦时。
#                      若设置成交比例为80%，则竞争交易电力规模为100*0.8=80万千瓦时。"),
#
#                    h2("报价规则"),
#                    p("报价规则牵涉的变量有："),
#                    tags$ul(tags$li("报价形式（双向报价，下面内容均特指该报价形式）"),tags$li("发电企业申报与上网电价的价差"),
#                            tags$li("发电企业申报与上网电价的价差范围"),tags$li("售电公司、电力大用户申报与现行目录电价中的价差"),tags$li("售电公司、电力大用户申报与现行目录电价中的价差范围")),
#                    p("所报价差必须在指定的价差范围内。"),
#                    p("例如：",
#                      div("发电企业申报价差范围：-50到-500厘/千瓦时。"),
#                      div("售电公司及电力用户申报价差范围：0到-100厘/千瓦时。"),
#                      div("发电企业上网电价为：500厘/千瓦时，申报价差：-100厘/千瓦时，表示期望卖出电价为400厘/千瓦时。"),
#                      div("售电公司及电力用户目录电价为500厘/千瓦时，申报价差为-50千瓦时，表示期望买入电价为450厘/千瓦时。"),
#
#                      h2("撮合规则"),
#                      p("这里，首先介绍下价差对的概念："),
#                      p("价差对=发电企业申报价差-售电公司或电力用户申报价差"),
#                      p("例如：发电企业申报价差为-100厘/千瓦时，电力大用户申报价差为-50厘/千瓦时，价差对为-100-（-50）= -50厘/千瓦时。"),
#                      p("需要注意的是："),
#                      tags$ul(tags$li("价差对只有是负的才可以成交，表示卖方对买方让利（试想，如果卖方一直保持高价格不对买方让利，交易怎么可能成交呢）。"),
#                              tags$li("卖方（发电企业）肯定希望价差的绝对值越小越好，这样表示他让利让的少啊。"),
#                              tags$li("买方（售电企业与电力用户）肯定希望价差的绝对值越大越好，因为这意味着自己买电的价格更低，从卖方获利越大。"),
#                              tags$li("价差对绝对值越大的越优先成交（相当于卖家让利最大）。"),
#                              tags$li("当价差对相同的时候，按申报价差对应电量比例确定中标电量。")),
#
#                      h2("结算规则"),
#                      p("结算规则主要涉及两点："),
#                      tags$ul(tags$li("价差电费返还：配对成交的买卖双方存在价差对，因此会产生价差电费，价差电费按照各自申报成交电费成比例返还给发电企业和大用户。"),
#                              tags$li("价差返还系数：50%意味着价差电费在价差对双方之间平均分配。"),
#                              tags$li("平均结算价格：（成交电量部分申报价差*成交电量+-返还电费）/总成交量")),
#
#                      h1("实例讲解"),
#                      p("下面附上一个例子，并附上相应代码仅供交流学习。"),
#
#                      h2("交易双方"),
#                      p("该交易涉及的发电企业与用电大用户数据如下："),
#                      img(src="http://7xlwwh.com1.z0.glb.clouddn.com/1.png"),
#
#                      h2("交易情况概述"),
#                      p("每轮的交易情况概述如下："),
#                      img(src="http://7xlwwh.com1.z0.glb.clouddn.com/2.png"),
#
#                      h2("交易结算"),
#                      p("发电企业的交易结算如下："),
#                      img(src="http://7xlwwh.com1.z0.glb.clouddn.com/3.png"),
#                      p("电力用户的交易结算如下："),
#                      img(src="http://7xlwwh.com1.z0.glb.clouddn.com/4.png")
#                    ))
#             )
#     )



))
